/* 学号 2452757 班级 姓名 */
#include <iostream>
using namespace std;

   /***************************************************************************
     函数名称：
     功    能：求num是不是base的幂
     输入参数：
     返 回 值：0 - 不是
               1 - 是
     说    明：函数名、形参、返回类型均不准动
   ***************************************************************************/
int is_power(int num, int base) {
    if (num == 1) {
        return 1;
    }
    if (num % base)
        return 0;

    return is_power(num / base, base);
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：完成输入、调用递归函数、输出
***************************************************************************/
int main()
{
    cout << "请输入整数num及基数base" << endl;
    int num, base;
    cin >> num >> base;
    int b = is_power(num, base);
    if (b) {
        cout << num << "是" << base << "的幂" << endl;
    }
    else {
        cout << num << "不是" << base << "的幂" << endl;
    }
}