/* 学号 2452757 姓名 xqj 班级 */
#include <iostream>
using namespace std;

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n) {
	int flag2 = 0;
	bool flag = false;
	if (n == -2147483648) {
		n = -(n + 1);
		flag2 = 1;
		flag = true;
	}

	if (n < 0) {
		n = -n;
		flag = true;
	}
	if (flag) {
		cout << "- ";
	}
	if (n / 10) {
		convert(n / 10);
	}
	
	cout << n % 10 + flag2 << " ";
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n; //不考虑输入错误 

	convert(n);
	cout << endl;

	return 0;
}