/* 班级 3 学号 2452757 姓名 xqj */
#include "hanoi.h";
#include <iostream>

using namespace std;
/* ----------------------------------------------------------------------------------

     本文件功能：
	1、放被 hanoi_main.cpp 调用的菜单函数，要求显示各菜单项，读入正确的选项后返回

     本文件要求：
	1、不允许定义外部全局变量（const及#define不在限制范围内）
	2、不允许定义静态全局变量（全局变量的使用准则是：少用、慎用、能不用尽量不用）
	3、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	4、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */


/***************************************************************************
  函数名称：menu
  功    能：输出菜单栏
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void menu() {
	cout << "---------------------------------" << endl;
	cout << "1.基本解\n" <<
		"2.基本解(步数记录)\n" <<
		"3.内部数组显示(横向)\n" <<
		"4.内部数组显示(纵向 + 横向)\n" <<
		"5.图形解-预备-画三个圆柱\n" <<
		"6.图形解-预备-在起始柱上画n个盘子\n" <<
		"7.图形解-预备-第一次移动\n" <<
		"8.图形解-自动移动版本\n" <<
		"9.图形解-游戏版\n" <<
		"0.退出\n";
	cout << "---------------------------------" << endl;
	cout << "[请选择:] ";
}